In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
pd.pandas.set_option('display.max_columns',None)

In [2]:
df=pd.read_csv('titanictest.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [4]:
features_with_na=[feature for feature in df.columns if(df[feature].isnull().sum()>1)]
for feature in features_with_na:
    print("The number of missing values in {} are:{}".format(feature,df[feature].isnull().sum()/len(df)))
#df[features_with_na].head()

The number of missing values in Age are:0.20574162679425836
The number of missing values in Cabin are:0.7822966507177034

In [5]:
df1=df.copy()
from sklearn.impute import SimpleImputer
imp_mean = SimpleImputer(missing_values=np.nan, strategy="mean")
imr = imp_mean.fit(df1[['Age']])
df1['Age']=imp_mean.transform(df1[['Age']]).ravel()
#SimpleImputer()
#print(imp_mean.transform(X))

In [6]:
df1['Age'].isnull().sum()

0

In [7]:
df2=df.copy()
from sklearn.experimental import enable_iterative_imputer  
from sklearn.impute import IterativeImputer
imp_mean = IterativeImputer(random_state=42)
df2['Age']=imp_mean.fit_transform(df2[['Age']]).ravel()

In [8]:
df2['Age'].isnull().sum()

0

In [9]:
df3=df.copy()
from sklearn.impute import KNNImputer
imputer = KNNImputer(n_neighbors=5, weights="uniform")
df3['Age']=imputer.fit_transform(df3[['Age']]).ravel()

In [10]:
df3['Age'].isnull().sum()

0